RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_exti.h
/*!
    \file    gd32h7xx_exti.h
    \brief   definitions for the EXTI

    \version 2024-01-05, V1.2.0, firmware for GD32H7xx
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H7XX_EXTI_H
#define GD32H7XX_EXTI_H

#include "gd32h7xx.h"

/* EXTI definition */
#define EXTI                          EXTI_BASE                      /*!< EXTI base address */

/* registers definitions */
#define EXTI_INTEN0                   REG32(EXTI + 0x00000000U)      /*!< interrupt enable register 0 */
#define EXTI_EVEN0                    REG32(EXTI + 0x00000004U)      /*!< event enable register 0 */
#define EXTI_RTEN0                    REG32(EXTI + 0x00000008U)      /*!< rising edge trigger enable register 0 */
#define EXTI_FTEN0                    REG32(EXTI + 0x0000000CU)      /*!< falling edge trigger enable register 0 */
#define EXTI_SWIEV0                   REG32(EXTI + 0x00000010U)      /*!< software interrupt event register 0 */
#define EXTI_PD0                      REG32(EXTI + 0x00000014U)      /*!< pending register 0 */
#define EXTI_INTEN1                   REG32(EXTI + 0x00000018U)      /*!< interrupt enable register 1 */
#define EXTI_EVEN1                    REG32(EXTI + 0x0000001CU)      /*!< event enable register 1 */
#define EXTI_RTEN1                    REG32(EXTI + 0x00000020U)      /*!< rising edge trigger enable register 1 */
#define EXTI_FTEN1                    REG32(EXTI + 0x00000024U)      /*!< falling edge trigger enable register 1 */
#define EXTI_SWIEV1                   REG32(EXTI + 0x00000028U)      /*!< software interrupt event register 1 */
#define EXTI_PD1                      REG32(EXTI + 0x0000002CU)      /*!< pending register 1 */

/* bits definitions */
/* EXTI_INTEN0 */
#define EXTI_INTEN0_INTEN0            BIT(0)                         /*!< interrupt from line 0 */
#define EXTI_INTEN0_INTEN1            BIT(1)                         /*!< interrupt from line 1 */
#define EXTI_INTEN0_INTEN2            BIT(2)                         /*!< interrupt from line 2 */
#define EXTI_INTEN0_INTEN3            BIT(3)                         /*!< interrupt from line 3 */
#define EXTI_INTEN0_INTEN4            BIT(4)                         /*!< interrupt from line 4 */
#define EXTI_INTEN0_INTEN5            BIT(5)                         /*!< interrupt from line 5 */
#define EXTI_INTEN0_INTEN6            BIT(6)                         /*!< interrupt from line 6 */
#define EXTI_INTEN0_INTEN7            BIT(7)                         /*!< interrupt from line 7 */
#define EXTI_INTEN0_INTEN8            BIT(8)                         /*!< interrupt from line 8 */
#define EXTI_INTEN0_INTEN9            BIT(9)                         /*!< interrupt from line 9 */
#define EXTI_INTEN0_INTEN10           BIT(10)                        /*!< interrupt from line 10 */
#define EXTI_INTEN0_INTEN11           BIT(11)                        /*!< interrupt from line 11 */
#define EXTI_INTEN0_INTEN12           BIT(12)                        /*!< interrupt from line 12 */
#define EXTI_INTEN0_INTEN13           BIT(13)                        /*!< interrupt from line 13 */
#define EXTI_INTEN0_INTEN14           BIT(14)                        /*!< interrupt from line 14 */
#define EXTI_INTEN0_INTEN15           BIT(15)                        /*!< interrupt from line 15 */
#define EXTI_INTEN0_INTEN16           BIT(16)                        /*!< interrupt from line 16 */
#define EXTI_INTEN0_INTEN17           BIT(17)                        /*!< interrupt from line 17 */
#define EXTI_INTEN0_INTEN18           BIT(18)                        /*!< interrupt from line 18 */
#define EXTI_INTEN0_INTEN19           BIT(19)                        /*!< interrupt from line 19 */
#define EXTI_INTEN0_INTEN20           BIT(20)                        /*!< interrupt from line 20 */
#define EXTI_INTEN0_INTEN21           BIT(21)                        /*!< interrupt from line 21 */
#define EXTI_INTEN0_INTEN22           BIT(22)                        /*!< interrupt from line 22 */
#define EXTI_INTEN0_INTEN23           BIT(23)                        /*!< interrupt from line 23 */
#define EXTI_INTEN0_INTEN24           BIT(24)                        /*!< interrupt from line 24 */
#define EXTI_INTEN0_INTEN25           BIT(25)                        /*!< interrupt from line 25 */
#define EXTI_INTEN0_INTEN26           BIT(26)                        /*!< interrupt from line 26 */
#define EXTI_INTEN0_INTEN27           BIT(27)                        /*!< interrupt from line 27 */
#define EXTI_INTEN0_INTEN28           BIT(28)                        /*!< interrupt from line 28 */
#define EXTI_INTEN0_INTEN29           BIT(29)                        /*!< interrupt from line 29 */
#define EXTI_INTEN0_INTEN30           BIT(30)                        /*!< interrupt from line 30 */
#define EXTI_INTEN0_INTEN31           BIT(31)                        /*!< interrupt from line 31 */

